Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/can.h
/*
 * Component description for CAN
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-07-26T17:56:43Z  */
#ifndef _PIC32CMSG00_CAN_COMPONENT_H_
#define _PIC32CMSG00_CAN_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR CAN                       */
/* ************************************************************************** */

/* -------- CAN_R0 : (CAN Offset: 0x00) (R/W 32) Rx Buffer and FIFO Element 0 -------- */
#define CAN_R0_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_R0) Rx Buffer and FIFO Element 0  Reset Value */

#define CAN_R0_ID_Pos                         _UINT32_(0)                                          /* (CAN_R0) Identifier Position */
#define CAN_R0_ID_Msk                         (_UINT32_(0x1FFFFFFF) << CAN_R0_ID_Pos)              /* (CAN_R0) Identifier Mask */
#define CAN_R0_ID(value)                      (CAN_R0_ID_Msk & (_UINT32_(value) << CAN_R0_ID_Pos)) /* Assignment of value for ID in the CAN_R0 register */
#define CAN_R0_RTR_Pos                        _UINT32_(29)                                         /* (CAN_R0) Remote Transmission Request Position */
#define CAN_R0_RTR_Msk                        (_UINT32_(0x1) << CAN_R0_RTR_Pos)                    /* (CAN_R0) Remote Transmission Request Mask */
#define CAN_R0_RTR(value)                     (CAN_R0_RTR_Msk & (_UINT32_(value) << CAN_R0_RTR_Pos)) /* Assignment of value for RTR in the CAN_R0 register */
#define CAN_R0_XTD_Pos                        _UINT32_(30)                                         /* (CAN_R0) Extended Identifier Position */
#define CAN_R0_XTD_Msk                        (_UINT32_(0x1) << CAN_R0_XTD_Pos)                    /* (CAN_R0) Extended Identifier Mask */
#define CAN_R0_XTD(value)                     (CAN_R0_XTD_Msk & (_UINT32_(value) << CAN_R0_XTD_Pos)) /* Assignment of value for XTD in the CAN_R0 register */
#define CAN_R0_ESI_Pos                        _UINT32_(31)                                         /* (CAN_R0) Error State Indicator Position */
#define CAN_R0_ESI_Msk                        (_UINT32_(0x1) << CAN_R0_ESI_Pos)                    /* (CAN_R0) Error State Indicator Mask */
#define CAN_R0_ESI(value)                     (CAN_R0_ESI_Msk & (_UINT32_(value) << CAN_R0_ESI_Pos)) /* Assignment of value for ESI in the CAN_R0 register */
#define CAN_R0_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (CAN_R0) Register Mask  */


/* -------- CAN_R1 : (CAN Offset: 0x04) (R/W 32) Rx Buffer and FIFO Element 1 -------- */
#define CAN_R1_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_R1) Rx Buffer and FIFO Element 1  Reset Value */

#define CAN_R1_RXTS_Pos                       _UINT32_(0)                                          /* (CAN_R1) Rx Timestamp Position */
#define CAN_R1_RXTS_Msk                       (_UINT32_(0xFFFF) << CAN_R1_RXTS_Pos)                /* (CAN_R1) Rx Timestamp Mask */
#define CAN_R1_RXTS(value)                    (CAN_R1_RXTS_Msk & (_UINT32_(value) << CAN_R1_RXTS_Pos)) /* Assignment of value for RXTS in the CAN_R1 register */
#define CAN_R1_DLC_Pos                        _UINT32_(16)                                         /* (CAN_R1) Data Length Code Position */
#define CAN_R1_DLC_Msk                        (_UINT32_(0xF) << CAN_R1_DLC_Pos)                    /* (CAN_R1) Data Length Code Mask */
#define CAN_R1_DLC(value)                     (CAN_R1_DLC_Msk & (_UINT32_(value) << CAN_R1_DLC_Pos)) /* Assignment of value for DLC in the CAN_R1 register */
#define CAN_R1_BRS_Pos                        _UINT32_(20)                                         /* (CAN_R1) Bit Rate Search Position */
#define CAN_R1_BRS_Msk                        (_UINT32_(0x1) << CAN_R1_BRS_Pos)                    /* (CAN_R1) Bit Rate Search Mask */
#define CAN_R1_BRS(value)                     (CAN_R1_BRS_Msk & (_UINT32_(value) << CAN_R1_BRS_Pos)) /* Assignment of value for BRS in the CAN_R1 register */
#define CAN_R1_FDF_Pos                        _UINT32_(21)                                         /* (CAN_R1) FD Format Position */
#define CAN_R1_FDF_Msk                        (_UINT32_(0x1) << CAN_R1_FDF_Pos)                    /* (CAN_R1) FD Format Mask */
#define CAN_R1_FDF(value)                     (CAN_R1_FDF_Msk & (_UINT32_(value) << CAN_R1_FDF_Pos)) /* Assignment of value for FDF in the CAN_R1 register */
#define CAN_R1_FIDX_Pos                       _UINT32_(24)                                         /* (CAN_R1) Filter Index Position */
#define CAN_R1_FIDX_Msk                       (_UINT32_(0x7F) << CAN_R1_FIDX_Pos)                  /* (CAN_R1) Filter Index Mask */
#define CAN_R1_FIDX(value)                    (CAN_R1_FIDX_Msk & (_UINT32_(value) << CAN_R1_FIDX_Pos)) /* Assignment of value for FIDX in the CAN_R1 register */
#define CAN_R1_ANMF_Pos                       _UINT32_(31)                                         /* (CAN_R1) Accepted Non-matching Frame Position */
#define CAN_R1_ANMF_Msk                       (_UINT32_(0x1) << CAN_R1_ANMF_Pos)                   /* (CAN_R1) Accepted Non-matching Frame Mask */
#define CAN_R1_ANMF(value)                    (CAN_R1_ANMF_Msk & (_UINT32_(value) << CAN_R1_ANMF_Pos)) /* Assignment of value for ANMF in the CAN_R1 register */
#define CAN_R1_Msk                            _UINT32_(0xFF3FFFFF)                                 /* (CAN_R1) Register Mask  */


/* -------- CAN_R2 : (CAN Offset: 0x08) (R/W 32) Rx Buffer and FIFO Element Data -------- */
#define CAN_R2_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_R2) Rx Buffer and FIFO Element Data  Reset Value */

#define CAN_R2_DB0_Pos                        _UINT32_(0)                                          /* (CAN_R2) Data Byte 0 Position */
#define CAN_R2_DB0_Msk                        (_UINT32_(0xFF) << CAN_R2_DB0_Pos)                   /* (CAN_R2) Data Byte 0 Mask */
#define CAN_R2_DB0(value)                     (CAN_R2_DB0_Msk & (_UINT32_(value) << CAN_R2_DB0_Pos)) /* Assignment of value for DB0 in the CAN_R2 register */
#define CAN_R2_DB1_Pos                        _UINT32_(8)                                          /* (CAN_R2) Data Byte 1 Position */
#define CAN_R2_DB1_Msk                        (_UINT32_(0xFF) << CAN_R2_DB1_Pos)                   /* (CAN_R2) Data Byte 1 Mask */
#define CAN_R2_DB1(value)                     (CAN_R2_DB1_Msk & (_UINT32_(value) << CAN_R2_DB1_Pos)) /* Assignment of value for DB1 in the CAN_R2 register */
#define CAN_R2_DB2_Pos                        _UINT32_(16)                                         /* (CAN_R2) Data Byte 2 Position */
#define CAN_R2_DB2_Msk                        (_UINT32_(0xFF) << CAN_R2_DB2_Pos)                   /* (CAN_R2) Data Byte 2 Mask */
#define CAN_R2_DB2(value)                     (CAN_R2_DB2_Msk & (_UINT32_(value) << CAN_R2_DB2_Pos)) /* Assignment of value for DB2 in the CAN_R2 register */
#define CAN_R2_DB3_Pos                        _UINT32_(24)                                         /* (CAN_R2) Data Byte 3 Position */
#define CAN_R2_DB3_Msk                        (_UINT32_(0xFF) << CAN_R2_DB3_Pos)                   /* (CAN_R2) Data Byte 3 Mask */
#define CAN_R2_DB3(value)                     (CAN_R2_DB3_Msk & (_UINT32_(value) << CAN_R2_DB3_Pos)) /* Assignment of value for DB3 in the CAN_R2 register */
#define CAN_R2_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (CAN_R2) Register Mask  */


/* -------- CAN_S0 : (CAN Offset: 0x00) (R/W 32) Standard Message ID Filter Element -------- */
#define CAN_S0_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_S0) Standard Message ID Filter Element  Reset Value */

#define CAN_S0_SFID2_Pos                      _UINT32_(0)                                          /* (CAN_S0) Standard Filter ID 2 Position */
#define CAN_S0_SFID2_Msk                      (_UINT32_(0x7FF) << CAN_S0_SFID2_Pos)                /* (CAN_S0) Standard Filter ID 2 Mask */
#define CAN_S0_SFID2(value)                   (CAN_S0_SFID2_Msk & (_UINT32_(value) << CAN_S0_SFID2_Pos)) /* Assignment of value for SFID2 in the CAN_S0 register */
#define CAN_S0_SFID1_Pos                      _UINT32_(16)                                         /* (CAN_S0) Standard Filter ID 1 Position */
#define CAN_S0_SFID1_Msk                      (_UINT32_(0x7FF) << CAN_S0_SFID1_Pos)                /* (CAN_S0) Standard Filter ID 1 Mask */
#define CAN_S0_SFID1(value)                   (CAN_S0_SFID1_Msk & (_UINT32_(value) << CAN_S0_SFID1_Pos)) /* Assignment of value for SFID1 in the CAN_S0 register */
#define CAN_S0_SFEC_Pos                       _UINT32_(27)                                         /* (CAN_S0) Standard Filter Element Configuration Position */
#define CAN_S0_SFEC_Msk                       (_UINT32_(0x7) << CAN_S0_SFEC_Pos)                   /* (CAN_S0) Standard Filter Element Configuration Mask */
#define CAN_S0_SFEC(value)                    (CAN_S0_SFEC_Msk & (_UINT32_(value) << CAN_S0_SFEC_Pos)) /* Assignment of value for SFEC in the CAN_S0 register */
#define   CAN_S0_SFEC_DISABLE_Val             _UINT32_(0x0)                                        /* (CAN_S0) Disable filter element  */
#define   CAN_S0_SFEC_STF0M_Val               _UINT32_(0x1)                                        /* (CAN_S0) Store in Rx FIFO 0 if filter match  */
#define   CAN_S0_SFEC_STF1M_Val               _UINT32_(0x2)                                        /* (CAN_S0) Store in Rx FIFO 1 if filter match  */
#define   CAN_S0_SFEC_REJECT_Val              _UINT32_(0x3)                                        /* (CAN_S0) Reject ID if filter match  */
#define   CAN_S0_SFEC_PRIORITY_Val            _UINT32_(0x4)                                        /* (CAN_S0) Set priority if filter match  */
#define   CAN_S0_SFEC_PRIF0M_Val              _UINT32_(0x5)                                        /* (CAN_S0) Set priority and store in FIFO 0 if filter match  */
#define   CAN_S0_SFEC_PRIF1M_Val              _UINT32_(0x6)                                        /* (CAN_S0) Set priority and store in FIFO 1 if filter match  */
#define   CAN_S0_SFEC_STRXBUF_Val             _UINT32_(0x7)                                        /* (CAN_S0) Store into Rx Buffer  */
#define CAN_S0_SFEC_DISABLE                   (CAN_S0_SFEC_DISABLE_Val << CAN_S0_SFEC_Pos)         /* (CAN_S0) Disable filter element Position */
#define CAN_S0_SFEC_STF0M                     (CAN_S0_SFEC_STF0M_Val << CAN_S0_SFEC_Pos)           /* (CAN_S0) Store in Rx FIFO 0 if filter match Position */
#define CAN_S0_SFEC_STF1M                     (CAN_S0_SFEC_STF1M_Val << CAN_S0_SFEC_Pos)           /* (CAN_S0) Store in Rx FIFO 1 if filter match Position */
#define CAN_S0_SFEC_REJECT                    (CAN_S0_SFEC_REJECT_Val << CAN_S0_SFEC_Pos)          /* (CAN_S0) Reject ID if filter match Position */
#define CAN_S0_SFEC_PRIORITY                  (CAN_S0_SFEC_PRIORITY_Val << CAN_S0_SFEC_Pos)        /* (CAN_S0) Set priority if filter match Position */
#define CAN_S0_SFEC_PRIF0M                    (CAN_S0_SFEC_PRIF0M_Val << CAN_S0_SFEC_Pos)          /* (CAN_S0) Set priority and store in FIFO 0 if filter match Position */
#define CAN_S0_SFEC_PRIF1M                    (CAN_S0_SFEC_PRIF1M_Val << CAN_S0_SFEC_Pos)          /* (CAN_S0) Set priority and store in FIFO 1 if filter match Position */
#define CAN_S0_SFEC_STRXBUF                   (CAN_S0_SFEC_STRXBUF_Val << CAN_S0_SFEC_Pos)         /* (CAN_S0) Store into Rx Buffer Position */
#define CAN_S0_SFT_Pos                        _UINT32_(30)                                         /* (CAN_S0) Standard Filter Type Position */
#define CAN_S0_SFT_Msk                        (_UINT32_(0x3) << CAN_S0_SFT_Pos)                    /* (CAN_S0) Standard Filter Type Mask */
#define CAN_S0_SFT(value)                     (CAN_S0_SFT_Msk & (_UINT32_(value) << CAN_S0_SFT_Pos)) /* Assignment of value for SFT in the CAN_S0 register */
#define   CAN_S0_SFT_RANGE_Val                _UINT32_(0x0)                                        /* (CAN_S0) Range filter from SFID1 to SFID2  */
#define   CAN_S0_SFT_DUAL_Val                 _UINT32_(0x1)                                        /* (CAN_S0) Dual ID filter for SFID1 or SFID2  */
#define   CAN_S0_SFT_CLASSIC_Val              _UINT32_(0x2)                                        /* (CAN_S0) Classic filter  */
#define CAN_S0_SFT_RANGE                      (CAN_S0_SFT_RANGE_Val << CAN_S0_SFT_Pos)             /* (CAN_S0) Range filter from SFID1 to SFID2 Position */
#define CAN_S0_SFT_DUAL                       (CAN_S0_SFT_DUAL_Val << CAN_S0_SFT_Pos)              /* (CAN_S0) Dual ID filter for SFID1 or SFID2 Position */
#define CAN_S0_SFT_CLASSIC                    (CAN_S0_SFT_CLASSIC_Val << CAN_S0_SFT_Pos)           /* (CAN_S0) Classic filter Position */
#define CAN_S0_Msk                            _UINT32_(0xFFFF07FF)                                 /* (CAN_S0) Register Mask  */


/* -------- CAN_T0 : (CAN Offset: 0x00) (R/W 32) Tx Buffer Element 0 -------- */
#define CAN_T0_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_T0) Tx Buffer Element 0  Reset Value */

