Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/can.h
#define CAN_T0_ID_Pos                         _UINT32_(0)                                          /* (CAN_T0) Identifier Position */
#define CAN_T0_ID_Msk                         (_UINT32_(0x1FFFFFFF) << CAN_T0_ID_Pos)              /* (CAN_T0) Identifier Mask */
#define CAN_T0_ID(value)                      (CAN_T0_ID_Msk & (_UINT32_(value) << CAN_T0_ID_Pos)) /* Assignment of value for ID in the CAN_T0 register */
#define CAN_T0_RTR_Pos                        _UINT32_(29)                                         /* (CAN_T0) Remote Transmission Request Position */
#define CAN_T0_RTR_Msk                        (_UINT32_(0x1) << CAN_T0_RTR_Pos)                    /* (CAN_T0) Remote Transmission Request Mask */
#define CAN_T0_RTR(value)                     (CAN_T0_RTR_Msk & (_UINT32_(value) << CAN_T0_RTR_Pos)) /* Assignment of value for RTR in the CAN_T0 register */
#define CAN_T0_XTD_Pos                        _UINT32_(30)                                         /* (CAN_T0) Extended Identifier Position */
#define CAN_T0_XTD_Msk                        (_UINT32_(0x1) << CAN_T0_XTD_Pos)                    /* (CAN_T0) Extended Identifier Mask */
#define CAN_T0_XTD(value)                     (CAN_T0_XTD_Msk & (_UINT32_(value) << CAN_T0_XTD_Pos)) /* Assignment of value for XTD in the CAN_T0 register */
#define CAN_T0_ESI_Pos                        _UINT32_(31)                                         /* (CAN_T0) Error State Indicator Position */
#define CAN_T0_ESI_Msk                        (_UINT32_(0x1) << CAN_T0_ESI_Pos)                    /* (CAN_T0) Error State Indicator Mask */
#define CAN_T0_ESI(value)                     (CAN_T0_ESI_Msk & (_UINT32_(value) << CAN_T0_ESI_Pos)) /* Assignment of value for ESI in the CAN_T0 register */
#define CAN_T0_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (CAN_T0) Register Mask  */


/* -------- CAN_T1 : (CAN Offset: 0x04) (R/W 32) Tx Buffer Element 1 -------- */
#define CAN_T1_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_T1) Tx Buffer Element 1  Reset Value */

#define CAN_T1_MMH_Pos                        _UINT32_(8)                                          /* (CAN_T1) Message Marker Higher Byte Position */
#define CAN_T1_MMH_Msk                        (_UINT32_(0xFF) << CAN_T1_MMH_Pos)                   /* (CAN_T1) Message Marker Higher Byte Mask */
#define CAN_T1_MMH(value)                     (CAN_T1_MMH_Msk & (_UINT32_(value) << CAN_T1_MMH_Pos)) /* Assignment of value for MMH in the CAN_T1 register */
#define CAN_T1_DLC_Pos                        _UINT32_(16)                                         /* (CAN_T1) Identifier Position */
#define CAN_T1_DLC_Msk                        (_UINT32_(0xF) << CAN_T1_DLC_Pos)                    /* (CAN_T1) Identifier Mask */
#define CAN_T1_DLC(value)                     (CAN_T1_DLC_Msk & (_UINT32_(value) << CAN_T1_DLC_Pos)) /* Assignment of value for DLC in the CAN_T1 register */
#define CAN_T1_BRS_Pos                        _UINT32_(20)                                         /* (CAN_T1) Bit Rate Search Position */
#define CAN_T1_BRS_Msk                        (_UINT32_(0x1) << CAN_T1_BRS_Pos)                    /* (CAN_T1) Bit Rate Search Mask */
#define CAN_T1_BRS(value)                     (CAN_T1_BRS_Msk & (_UINT32_(value) << CAN_T1_BRS_Pos)) /* Assignment of value for BRS in the CAN_T1 register */
#define CAN_T1_FDF_Pos                        _UINT32_(21)                                         /* (CAN_T1) FD Format Position */
#define CAN_T1_FDF_Msk                        (_UINT32_(0x1) << CAN_T1_FDF_Pos)                    /* (CAN_T1) FD Format Mask */
#define CAN_T1_FDF(value)                     (CAN_T1_FDF_Msk & (_UINT32_(value) << CAN_T1_FDF_Pos)) /* Assignment of value for FDF in the CAN_T1 register */
#define CAN_T1_TSCE_Pos                       _UINT32_(22)                                         /* (CAN_T1) Time Stamp Capture Enable for TSU Position */
#define CAN_T1_TSCE_Msk                       (_UINT32_(0x1) << CAN_T1_TSCE_Pos)                   /* (CAN_T1) Time Stamp Capture Enable for TSU Mask */
#define CAN_T1_TSCE(value)                    (CAN_T1_TSCE_Msk & (_UINT32_(value) << CAN_T1_TSCE_Pos)) /* Assignment of value for TSCE in the CAN_T1 register */
#define CAN_T1_EFC_Pos                        _UINT32_(23)                                         /* (CAN_T1) Event FIFO Control Position */
#define CAN_T1_EFC_Msk                        (_UINT32_(0x1) << CAN_T1_EFC_Pos)                    /* (CAN_T1) Event FIFO Control Mask */
#define CAN_T1_EFC(value)                     (CAN_T1_EFC_Msk & (_UINT32_(value) << CAN_T1_EFC_Pos)) /* Assignment of value for EFC in the CAN_T1 register */
#define CAN_T1_MML_Pos                        _UINT32_(24)                                         /* (CAN_T1) Message Marker Lower Byte Position */
#define CAN_T1_MML_Msk                        (_UINT32_(0xFF) << CAN_T1_MML_Pos)                   /* (CAN_T1) Message Marker Lower Byte Mask */
#define CAN_T1_MML(value)                     (CAN_T1_MML_Msk & (_UINT32_(value) << CAN_T1_MML_Pos)) /* Assignment of value for MML in the CAN_T1 register */
#define CAN_T1_Msk                            _UINT32_(0xFFFFFF00)                                 /* (CAN_T1) Register Mask  */


/* -------- CAN_T2 : (CAN Offset: 0x08) (R/W 32) Tx Buffer Element Data -------- */
#define CAN_T2_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_T2) Tx Buffer Element Data  Reset Value */

#define CAN_T2_DB0_Pos                        _UINT32_(0)                                          /* (CAN_T2) Data Byte 0 Position */
#define CAN_T2_DB0_Msk                        (_UINT32_(0xFF) << CAN_T2_DB0_Pos)                   /* (CAN_T2) Data Byte 0 Mask */
#define CAN_T2_DB0(value)                     (CAN_T2_DB0_Msk & (_UINT32_(value) << CAN_T2_DB0_Pos)) /* Assignment of value for DB0 in the CAN_T2 register */
#define CAN_T2_DB1_Pos                        _UINT32_(8)                                          /* (CAN_T2) Data Byte 1 Position */
#define CAN_T2_DB1_Msk                        (_UINT32_(0xFF) << CAN_T2_DB1_Pos)                   /* (CAN_T2) Data Byte 1 Mask */
#define CAN_T2_DB1(value)                     (CAN_T2_DB1_Msk & (_UINT32_(value) << CAN_T2_DB1_Pos)) /* Assignment of value for DB1 in the CAN_T2 register */
#define CAN_T2_DB2_Pos                        _UINT32_(16)                                         /* (CAN_T2) Data Byte 2 Position */
#define CAN_T2_DB2_Msk                        (_UINT32_(0xFF) << CAN_T2_DB2_Pos)                   /* (CAN_T2) Data Byte 2 Mask */
#define CAN_T2_DB2(value)                     (CAN_T2_DB2_Msk & (_UINT32_(value) << CAN_T2_DB2_Pos)) /* Assignment of value for DB2 in the CAN_T2 register */
#define CAN_T2_DB3_Pos                        _UINT32_(24)                                         /* (CAN_T2) Data Byte 3 Position */
#define CAN_T2_DB3_Msk                        (_UINT32_(0xFF) << CAN_T2_DB3_Pos)                   /* (CAN_T2) Data Byte 3 Mask */
#define CAN_T2_DB3(value)                     (CAN_T2_DB3_Msk & (_UINT32_(value) << CAN_T2_DB3_Pos)) /* Assignment of value for DB3 in the CAN_T2 register */
#define CAN_T2_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (CAN_T2) Register Mask  */


/* -------- CAN_E0 : (CAN Offset: 0x00) (R/W 32) Tx Event FIFO Element 0 -------- */
#define CAN_E0_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_E0) Tx Event FIFO Element 0  Reset Value */

#define CAN_E0_ID_Pos                         _UINT32_(0)                                          /* (CAN_E0) Identifier Position */
#define CAN_E0_ID_Msk                         (_UINT32_(0x1FFFFFFF) << CAN_E0_ID_Pos)              /* (CAN_E0) Identifier Mask */
#define CAN_E0_ID(value)                      (CAN_E0_ID_Msk & (_UINT32_(value) << CAN_E0_ID_Pos)) /* Assignment of value for ID in the CAN_E0 register */
#define CAN_E0_RTR_Pos                        _UINT32_(29)                                         /* (CAN_E0) Remote Transmission Request Position */
#define CAN_E0_RTR_Msk                        (_UINT32_(0x1) << CAN_E0_RTR_Pos)                    /* (CAN_E0) Remote Transmission Request Mask */
#define CAN_E0_RTR(value)                     (CAN_E0_RTR_Msk & (_UINT32_(value) << CAN_E0_RTR_Pos)) /* Assignment of value for RTR in the CAN_E0 register */
#define CAN_E0_XTD_Pos                        _UINT32_(30)                                         /* (CAN_E0) Extended Indentifier Position */
#define CAN_E0_XTD_Msk                        (_UINT32_(0x1) << CAN_E0_XTD_Pos)                    /* (CAN_E0) Extended Indentifier Mask */
#define CAN_E0_XTD(value)                     (CAN_E0_XTD_Msk & (_UINT32_(value) << CAN_E0_XTD_Pos)) /* Assignment of value for XTD in the CAN_E0 register */
#define CAN_E0_ESI_Pos                        _UINT32_(31)                                         /* (CAN_E0) Error State Indicator Position */
#define CAN_E0_ESI_Msk                        (_UINT32_(0x1) << CAN_E0_ESI_Pos)                    /* (CAN_E0) Error State Indicator Mask */
#define CAN_E0_ESI(value)                     (CAN_E0_ESI_Msk & (_UINT32_(value) << CAN_E0_ESI_Pos)) /* Assignment of value for ESI in the CAN_E0 register */
#define CAN_E0_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (CAN_E0) Register Mask  */


/* -------- CAN_E1 : (CAN Offset: 0x04) (R/W 32) Tx Event FIFO Element 1 -------- */
#define CAN_E1_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_E1) Tx Event FIFO Element 1  Reset Value */

