Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/can.h
#define CAN_E1_TXTS_Pos                       _UINT32_(0)                                          /* (CAN_E1) Tx Timestamp Position */
#define CAN_E1_TXTS_Msk                       (_UINT32_(0xFFFF) << CAN_E1_TXTS_Pos)                /* (CAN_E1) Tx Timestamp Mask */
#define CAN_E1_TXTS(value)                    (CAN_E1_TXTS_Msk & (_UINT32_(value) << CAN_E1_TXTS_Pos)) /* Assignment of value for TXTS in the CAN_E1 register */
#define CAN_E1_DLC_Pos                        _UINT32_(16)                                         /* (CAN_E1) Data Length Code Position */
#define CAN_E1_DLC_Msk                        (_UINT32_(0xF) << CAN_E1_DLC_Pos)                    /* (CAN_E1) Data Length Code Mask */
#define CAN_E1_DLC(value)                     (CAN_E1_DLC_Msk & (_UINT32_(value) << CAN_E1_DLC_Pos)) /* Assignment of value for DLC in the CAN_E1 register */
#define CAN_E1_BRS_Pos                        _UINT32_(20)                                         /* (CAN_E1) Bit Rate Search Position */
#define CAN_E1_BRS_Msk                        (_UINT32_(0x1) << CAN_E1_BRS_Pos)                    /* (CAN_E1) Bit Rate Search Mask */
#define CAN_E1_BRS(value)                     (CAN_E1_BRS_Msk & (_UINT32_(value) << CAN_E1_BRS_Pos)) /* Assignment of value for BRS in the CAN_E1 register */
#define CAN_E1_FDF_Pos                        _UINT32_(21)                                         /* (CAN_E1) FD Format Position */
#define CAN_E1_FDF_Msk                        (_UINT32_(0x1) << CAN_E1_FDF_Pos)                    /* (CAN_E1) FD Format Mask */
#define CAN_E1_FDF(value)                     (CAN_E1_FDF_Msk & (_UINT32_(value) << CAN_E1_FDF_Pos)) /* Assignment of value for FDF in the CAN_E1 register */
#define CAN_E1_ET_Pos                         _UINT32_(22)                                         /* (CAN_E1) Event Type Position */
#define CAN_E1_ET_Msk                         (_UINT32_(0x3) << CAN_E1_ET_Pos)                     /* (CAN_E1) Event Type Mask */
#define CAN_E1_ET(value)                      (CAN_E1_ET_Msk & (_UINT32_(value) << CAN_E1_ET_Pos)) /* Assignment of value for ET in the CAN_E1 register */
#define   CAN_E1_ET_TXE_Val                   _UINT32_(0x1)                                        /* (CAN_E1) Tx event  */
#define   CAN_E1_ET_TXC_Val                   _UINT32_(0x2)                                        /* (CAN_E1) Transmission in spite of cancellation  */
#define CAN_E1_ET_TXE                         (CAN_E1_ET_TXE_Val << CAN_E1_ET_Pos)                 /* (CAN_E1) Tx event Position */
#define CAN_E1_ET_TXC                         (CAN_E1_ET_TXC_Val << CAN_E1_ET_Pos)                 /* (CAN_E1) Transmission in spite of cancellation Position */
#define CAN_E1_MM_Pos                         _UINT32_(24)                                         /* (CAN_E1) Message Marker Position */
#define CAN_E1_MM_Msk                         (_UINT32_(0xFF) << CAN_E1_MM_Pos)                    /* (CAN_E1) Message Marker Mask */
#define CAN_E1_MM(value)                      (CAN_E1_MM_Msk & (_UINT32_(value) << CAN_E1_MM_Pos)) /* Assignment of value for MM in the CAN_E1 register */
#define CAN_E1_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (CAN_E1) Register Mask  */


/* -------- CAN_F0 : (CAN Offset: 0x00) (R/W 32) Extended Message ID Filter Element 0 -------- */
#define CAN_F0_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_F0) Extended Message ID Filter Element 0  Reset Value */

#define CAN_F0_EFID1_Pos                      _UINT32_(0)                                          /* (CAN_F0) Extended Filter ID 1 Position */
#define CAN_F0_EFID1_Msk                      (_UINT32_(0x1FFFFFFF) << CAN_F0_EFID1_Pos)           /* (CAN_F0) Extended Filter ID 1 Mask */
#define CAN_F0_EFID1(value)                   (CAN_F0_EFID1_Msk & (_UINT32_(value) << CAN_F0_EFID1_Pos)) /* Assignment of value for EFID1 in the CAN_F0 register */
#define CAN_F0_EFEC_Pos                       _UINT32_(29)                                         /* (CAN_F0) Extended Filter Element Configuration Position */
#define CAN_F0_EFEC_Msk                       (_UINT32_(0x7) << CAN_F0_EFEC_Pos)                   /* (CAN_F0) Extended Filter Element Configuration Mask */
#define CAN_F0_EFEC(value)                    (CAN_F0_EFEC_Msk & (_UINT32_(value) << CAN_F0_EFEC_Pos)) /* Assignment of value for EFEC in the CAN_F0 register */
#define   CAN_F0_EFEC_DISABLE_Val             _UINT32_(0x0)                                        /* (CAN_F0) Disable filter element  */
#define   CAN_F0_EFEC_STF0M_Val               _UINT32_(0x1)                                        /* (CAN_F0) Store in Rx FIFO 0 if filter match  */
#define   CAN_F0_EFEC_STF1M_Val               _UINT32_(0x2)                                        /* (CAN_F0) Store in Rx FIFO 1 if filter match  */
#define   CAN_F0_EFEC_REJECT_Val              _UINT32_(0x3)                                        /* (CAN_F0) Reject ID if filter match  */
#define   CAN_F0_EFEC_PRIORITY_Val            _UINT32_(0x4)                                        /* (CAN_F0) Set priority if filter match  */
#define   CAN_F0_EFEC_PRIF0M_Val              _UINT32_(0x5)                                        /* (CAN_F0) Set priority and store in FIFO 0 if filter match  */
#define   CAN_F0_EFEC_PRIF1M_Val              _UINT32_(0x6)                                        /* (CAN_F0) Set priority and store in FIFO 1 if filter match  */
#define   CAN_F0_EFEC_STRXBUF_Val             _UINT32_(0x7)                                        /* (CAN_F0) Store into Rx Buffer  */
#define CAN_F0_EFEC_DISABLE                   (CAN_F0_EFEC_DISABLE_Val << CAN_F0_EFEC_Pos)         /* (CAN_F0) Disable filter element Position */
#define CAN_F0_EFEC_STF0M                     (CAN_F0_EFEC_STF0M_Val << CAN_F0_EFEC_Pos)           /* (CAN_F0) Store in Rx FIFO 0 if filter match Position */
#define CAN_F0_EFEC_STF1M                     (CAN_F0_EFEC_STF1M_Val << CAN_F0_EFEC_Pos)           /* (CAN_F0) Store in Rx FIFO 1 if filter match Position */
#define CAN_F0_EFEC_REJECT                    (CAN_F0_EFEC_REJECT_Val << CAN_F0_EFEC_Pos)          /* (CAN_F0) Reject ID if filter match Position */
#define CAN_F0_EFEC_PRIORITY                  (CAN_F0_EFEC_PRIORITY_Val << CAN_F0_EFEC_Pos)        /* (CAN_F0) Set priority if filter match Position */
#define CAN_F0_EFEC_PRIF0M                    (CAN_F0_EFEC_PRIF0M_Val << CAN_F0_EFEC_Pos)          /* (CAN_F0) Set priority and store in FIFO 0 if filter match Position */
#define CAN_F0_EFEC_PRIF1M                    (CAN_F0_EFEC_PRIF1M_Val << CAN_F0_EFEC_Pos)          /* (CAN_F0) Set priority and store in FIFO 1 if filter match Position */
#define CAN_F0_EFEC_STRXBUF                   (CAN_F0_EFEC_STRXBUF_Val << CAN_F0_EFEC_Pos)         /* (CAN_F0) Store into Rx Buffer Position */
#define CAN_F0_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (CAN_F0) Register Mask  */


