Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/can.h
/* -------- CAN_F1 : (CAN Offset: 0x04) (R/W 32) Extended Message ID Filter Element 1 -------- */
#define CAN_F1_RESETVALUE                     _UINT32_(0x00)                                       /*  (CAN_F1) Extended Message ID Filter Element 1  Reset Value */

#define CAN_F1_EFID2_Pos                      _UINT32_(0)                                          /* (CAN_F1) Extended Filter ID 2 Position */
#define CAN_F1_EFID2_Msk                      (_UINT32_(0x1FFFFFFF) << CAN_F1_EFID2_Pos)           /* (CAN_F1) Extended Filter ID 2 Mask */
#define CAN_F1_EFID2(value)                   (CAN_F1_EFID2_Msk & (_UINT32_(value) << CAN_F1_EFID2_Pos)) /* Assignment of value for EFID2 in the CAN_F1 register */
#define CAN_F1_EFT_Pos                        _UINT32_(30)                                         /* (CAN_F1) Extended Filter Type Position */
#define CAN_F1_EFT_Msk                        (_UINT32_(0x3) << CAN_F1_EFT_Pos)                    /* (CAN_F1) Extended Filter Type Mask */
#define CAN_F1_EFT(value)                     (CAN_F1_EFT_Msk & (_UINT32_(value) << CAN_F1_EFT_Pos)) /* Assignment of value for EFT in the CAN_F1 register */
#define   CAN_F1_EFT_RANGEM_Val               _UINT32_(0x0)                                        /* (CAN_F1) Range filter from EFID1 to EFID2  */
#define   CAN_F1_EFT_DUAL_Val                 _UINT32_(0x1)                                        /* (CAN_F1) Dual ID filter for EFID1 or EFID2  */
#define   CAN_F1_EFT_CLASSIC_Val              _UINT32_(0x2)                                        /* (CAN_F1) Classic filter  */
#define   CAN_F1_EFT_RANGE_Val                _UINT32_(0x3)                                        /* (CAN_F1) Range filter from EFID1 to EFID2 with no XIDAM mask  */
#define CAN_F1_EFT_RANGEM                     (CAN_F1_EFT_RANGEM_Val << CAN_F1_EFT_Pos)            /* (CAN_F1) Range filter from EFID1 to EFID2 Position */
#define CAN_F1_EFT_DUAL                       (CAN_F1_EFT_DUAL_Val << CAN_F1_EFT_Pos)              /* (CAN_F1) Dual ID filter for EFID1 or EFID2 Position */
#define CAN_F1_EFT_CLASSIC                    (CAN_F1_EFT_CLASSIC_Val << CAN_F1_EFT_Pos)           /* (CAN_F1) Classic filter Position */
#define CAN_F1_EFT_RANGE                      (CAN_F1_EFT_RANGE_Val << CAN_F1_EFT_Pos)             /* (CAN_F1) Range filter from EFID1 to EFID2 with no XIDAM mask Position */
#define CAN_F1_Msk                            _UINT32_(0xDFFFFFFF)                                 /* (CAN_F1) Register Mask  */


/* -------- CAN_CTRLA : (CAN Offset: 0x00) (R/W 32) Control A Register -------- */
#define CAN_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (CAN_CTRLA) Control A Register  Reset Value */

#define CAN_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (CAN_CTRLA) Software Reset Position */
#define CAN_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << CAN_CTRLA_SWRST_Pos)               /* (CAN_CTRLA) Software Reset Mask */
#define CAN_CTRLA_SWRST(value)                (CAN_CTRLA_SWRST_Msk & (_UINT32_(value) << CAN_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the CAN_CTRLA register */
#define CAN_CTRLA_PRIV_Pos                    _UINT32_(2)                                          /* (CAN_CTRLA) Priveged Access Position */
#define CAN_CTRLA_PRIV_Msk                    (_UINT32_(0x1) << CAN_CTRLA_PRIV_Pos)                /* (CAN_CTRLA) Priveged Access Mask */
#define CAN_CTRLA_PRIV(value)                 (CAN_CTRLA_PRIV_Msk & (_UINT32_(value) << CAN_CTRLA_PRIV_Pos)) /* Assignment of value for PRIV in the CAN_CTRLA register */
#define CAN_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (CAN_CTRLA) Run during standby Position */
#define CAN_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << CAN_CTRLA_RUNSTDBY_Pos)            /* (CAN_CTRLA) Run during standby Mask */
#define CAN_CTRLA_RUNSTDBY(value)             (CAN_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << CAN_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the CAN_CTRLA register */
#define CAN_CTRLA_Msk                         _UINT32_(0x00000045)                                 /* (CAN_CTRLA) Register Mask  */


/* -------- CAN_CTRLB : (CAN Offset: 0x04) (R/W 32) Control B Register -------- */
#define CAN_CTRLB_RESETVALUE                  _UINT32_(0x00)                                       /*  (CAN_CTRLB) Control B Register  Reset Value */

#define CAN_CTRLB_OFFSET_Pos                  _UINT32_(16)                                         /* (CAN_CTRLB) Message RAM Base Address Offset. Position */
#define CAN_CTRLB_OFFSET_Msk                  (_UINT32_(0xFF) << CAN_CTRLB_OFFSET_Pos)             /* (CAN_CTRLB) Message RAM Base Address Offset. Mask */
#define CAN_CTRLB_OFFSET(value)               (CAN_CTRLB_OFFSET_Msk & (_UINT32_(value) << CAN_CTRLB_OFFSET_Pos)) /* Assignment of value for OFFSET in the CAN_CTRLB register */
#define CAN_CTRLB_Msk                         _UINT32_(0x00FF0000)                                 /* (CAN_CTRLB) Register Mask  */


/* -------- CAN_INTENCLR : (CAN Offset: 0x28) (R/W 32) Interrupt Enable Clear register -------- */
#define CAN_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (CAN_INTENCLR) Interrupt Enable Clear register  Reset Value */

#define CAN_INTENCLR_DBG_Pos                  _UINT32_(0)                                          /* (CAN_INTENCLR) Debug Message Interrupt Disable Position */
#define CAN_INTENCLR_DBG_Msk                  (_UINT32_(0x1) << CAN_INTENCLR_DBG_Pos)              /* (CAN_INTENCLR) Debug Message Interrupt Disable Mask */
#define CAN_INTENCLR_DBG(value)               (CAN_INTENCLR_DBG_Msk & (_UINT32_(value) << CAN_INTENCLR_DBG_Pos)) /* Assignment of value for DBG in the CAN_INTENCLR register */
#define CAN_INTENCLR_BERR_Pos                 _UINT32_(1)                                          /* (CAN_INTENCLR) Bus Error Interrupt Enable Position */
#define CAN_INTENCLR_BERR_Msk                 (_UINT32_(0x1) << CAN_INTENCLR_BERR_Pos)             /* (CAN_INTENCLR) Bus Error Interrupt Enable Mask */
#define CAN_INTENCLR_BERR(value)              (CAN_INTENCLR_BERR_Msk & (_UINT32_(value) << CAN_INTENCLR_BERR_Pos)) /* Assignment of value for BERR in the CAN_INTENCLR register */
#define CAN_INTENCLR_Msk                      _UINT32_(0x00000003)                                 /* (CAN_INTENCLR) Register Mask  */


/* -------- CAN_INTENSET : (CAN Offset: 0x2C) (R/W 32) Interrupt Enable Set register -------- */
#define CAN_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (CAN_INTENSET) Interrupt Enable Set register  Reset Value */

#define CAN_INTENSET_DBG_Pos                  _UINT32_(0)                                          /* (CAN_INTENSET) Debug Message Interrupt Enable Position */
#define CAN_INTENSET_DBG_Msk                  (_UINT32_(0x1) << CAN_INTENSET_DBG_Pos)              /* (CAN_INTENSET) Debug Message Interrupt Enable Mask */
#define CAN_INTENSET_DBG(value)               (CAN_INTENSET_DBG_Msk & (_UINT32_(value) << CAN_INTENSET_DBG_Pos)) /* Assignment of value for DBG in the CAN_INTENSET register */
#define CAN_INTENSET_BERR_Pos                 _UINT32_(1)                                          /* (CAN_INTENSET) Bus Error Interrupt Enable Position */
#define CAN_INTENSET_BERR_Msk                 (_UINT32_(0x1) << CAN_INTENSET_BERR_Pos)             /* (CAN_INTENSET) Bus Error Interrupt Enable Mask */
#define CAN_INTENSET_BERR(value)              (CAN_INTENSET_BERR_Msk & (_UINT32_(value) << CAN_INTENSET_BERR_Pos)) /* Assignment of value for BERR in the CAN_INTENSET register */
#define CAN_INTENSET_Msk                      _UINT32_(0x00000003)                                 /* (CAN_INTENSET) Register Mask  */


/* -------- CAN_INTFLAG : (CAN Offset: 0x30) (R/W 32) Interrupt Flag Status and Clear register -------- */
#define CAN_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (CAN_INTFLAG) Interrupt Flag Status and Clear register  Reset Value */

#define CAN_INTFLAG_DBG_Pos                   _UINT32_(0)                                          /* (CAN_INTFLAG) Debug Message Reception Position */
#define CAN_INTFLAG_DBG_Msk                   (_UINT32_(0x1) << CAN_INTFLAG_DBG_Pos)               /* (CAN_INTFLAG) Debug Message Reception Mask */
#define CAN_INTFLAG_DBG(value)                (CAN_INTFLAG_DBG_Msk & (_UINT32_(value) << CAN_INTFLAG_DBG_Pos)) /* Assignment of value for DBG in the CAN_INTFLAG register */
#define CAN_INTFLAG_BERR_Pos                  _UINT32_(1)                                          /* (CAN_INTFLAG) AHB Bus Error Detection Position */
#define CAN_INTFLAG_BERR_Msk                  (_UINT32_(0x1) << CAN_INTFLAG_BERR_Pos)              /* (CAN_INTFLAG) AHB Bus Error Detection Mask */
#define CAN_INTFLAG_BERR(value)               (CAN_INTFLAG_BERR_Msk & (_UINT32_(value) << CAN_INTFLAG_BERR_Pos)) /* Assignment of value for BERR in the CAN_INTFLAG register */
#define CAN_INTFLAG_Msk                       _UINT32_(0x00000003)                                 /* (CAN_INTFLAG) Register Mask  */


/* -------- CAN_INTFLAGSET : (CAN Offset: 0x34) (R/W 32) Interrupt Flag Software Set Register -------- */
#define CAN_INTFLAGSET_RESETVALUE             _UINT32_(0x00)                                       /*  (CAN_INTFLAGSET) Interrupt Flag Software Set Register  Reset Value */

#define CAN_INTFLAGSET_DBG_Pos                _UINT32_(0)                                          /* (CAN_INTFLAGSET) Debug Message Interrupt Flag Set Position */
#define CAN_INTFLAGSET_DBG_Msk                (_UINT32_(0x1) << CAN_INTFLAGSET_DBG_Pos)            /* (CAN_INTFLAGSET) Debug Message Interrupt Flag Set Mask */
#define CAN_INTFLAGSET_DBG(value)             (CAN_INTFLAGSET_DBG_Msk & (_UINT32_(value) << CAN_INTFLAGSET_DBG_Pos)) /* Assignment of value for DBG in the CAN_INTFLAGSET register */
#define CAN_INTFLAGSET_BERR_Pos               _UINT32_(1)                                          /* (CAN_INTFLAGSET) AHB Bus Error Detection Interrupt Flag Set Position */
#define CAN_INTFLAGSET_BERR_Msk               (_UINT32_(0x1) << CAN_INTFLAGSET_BERR_Pos)           /* (CAN_INTFLAGSET) AHB Bus Error Detection Interrupt Flag Set Mask */
#define CAN_INTFLAGSET_BERR(value)            (CAN_INTFLAGSET_BERR_Msk & (_UINT32_(value) << CAN_INTFLAGSET_BERR_Pos)) /* Assignment of value for BERR in the CAN_INTFLAGSET register */
#define CAN_INTFLAGSET_Msk                    _UINT32_(0x00000003)                                 /* (CAN_INTFLAGSET) Register Mask  */


/* -------- CAN_SYNCBUSY : (CAN Offset: 0x5C) ( R/ 32) SYNCBUSY Register -------- */
#define CAN_SYNCBUSY_RESETVALUE               _UINT32_(0x00)                                       /*  (CAN_SYNCBUSY) SYNCBUSY Register  Reset Value */

#define CAN_SYNCBUSY_SWRST_Pos                _UINT32_(0)                                          /* (CAN_SYNCBUSY) Software Reset Synchronization Busy Position */
#define CAN_SYNCBUSY_SWRST_Msk                (_UINT32_(0x1) << CAN_SYNCBUSY_SWRST_Pos)            /* (CAN_SYNCBUSY) Software Reset Synchronization Busy Mask */
#define CAN_SYNCBUSY_SWRST(value)             (CAN_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << CAN_SYNCBUSY_SWRST_Pos)) /* Assignment of value for SWRST in the CAN_SYNCBUSY register */
#define CAN_SYNCBUSY_Msk                      _UINT32_(0x00000001)                                 /* (CAN_SYNCBUSY) Register Mask  */


/* -------- CAN_CREL_MCAN : (CAN Offset: 0x100) ( R/ 32) Core Release -------- */
#define CAN_CREL_MCAN_RESETVALUE              _UINT32_(0x33000000)                                 /*  (CAN_CREL_MCAN) Core Release  Reset Value */

#define CAN_CREL_MCAN_DAY_Pos                 _UINT32_(0)                                          /* (CAN_CREL_MCAN) Timestamp day Position */
#define CAN_CREL_MCAN_DAY_Msk                 (_UINT32_(0xFF) << CAN_CREL_MCAN_DAY_Pos)            /* (CAN_CREL_MCAN) Timestamp day Mask */
#define CAN_CREL_MCAN_DAY(value)              (CAN_CREL_MCAN_DAY_Msk & (_UINT32_(value) << CAN_CREL_MCAN_DAY_Pos)) /* Assignment of value for DAY in the CAN_CREL_MCAN register */
#define CAN_CREL_MCAN_MON_Pos                 _UINT32_(8)                                          /* (CAN_CREL_MCAN) Timestamp month Position */
#define CAN_CREL_MCAN_MON_Msk                 (_UINT32_(0xFF) << CAN_CREL_MCAN_MON_Pos)            /* (CAN_CREL_MCAN) Timestamp month Mask */
#define CAN_CREL_MCAN_MON(value)              (CAN_CREL_MCAN_MON_Msk & (_UINT32_(value) << CAN_CREL_MCAN_MON_Pos)) /* Assignment of value for MON in the CAN_CREL_MCAN register */
#define CAN_CREL_MCAN_YEAR_Pos                _UINT32_(16)                                         /* (CAN_CREL_MCAN) Timestamp year Position */
#define CAN_CREL_MCAN_YEAR_Msk                (_UINT32_(0xF) << CAN_CREL_MCAN_YEAR_Pos)            /* (CAN_CREL_MCAN) Timestamp year Mask */
#define CAN_CREL_MCAN_YEAR(value)             (CAN_CREL_MCAN_YEAR_Msk & (_UINT32_(value) << CAN_CREL_MCAN_YEAR_Pos)) /* Assignment of value for YEAR in the CAN_CREL_MCAN register */
#define CAN_CREL_MCAN_SUBSTEP_Pos             _UINT32_(20)                                         /* (CAN_CREL_MCAN) Sub-step of Core Release Position */
#define CAN_CREL_MCAN_SUBSTEP_Msk             (_UINT32_(0xF) << CAN_CREL_MCAN_SUBSTEP_Pos)         /* (CAN_CREL_MCAN) Sub-step of Core Release Mask */
#define CAN_CREL_MCAN_SUBSTEP(value)          (CAN_CREL_MCAN_SUBSTEP_Msk & (_UINT32_(value) << CAN_CREL_MCAN_SUBSTEP_Pos)) /* Assignment of value for SUBSTEP in the CAN_CREL_MCAN register */
#define CAN_CREL_MCAN_STEP_Pos                _UINT32_(24)                                         /* (CAN_CREL_MCAN) Step of Core Release Position */
#define CAN_CREL_MCAN_STEP_Msk                (_UINT32_(0xF) << CAN_CREL_MCAN_STEP_Pos)            /* (CAN_CREL_MCAN) Step of Core Release Mask */
#define CAN_CREL_MCAN_STEP(value)             (CAN_CREL_MCAN_STEP_Msk & (_UINT32_(value) << CAN_CREL_MCAN_STEP_Pos)) /* Assignment of value for STEP in the CAN_CREL_MCAN register */
#define CAN_CREL_MCAN_REL_Pos                 _UINT32_(28)                                         /* (CAN_CREL_MCAN) Core Release Position */
#define CAN_CREL_MCAN_REL_Msk                 (_UINT32_(0xF) << CAN_CREL_MCAN_REL_Pos)             /* (CAN_CREL_MCAN) Core Release Mask */
#define CAN_CREL_MCAN_REL(value)              (CAN_CREL_MCAN_REL_Msk & (_UINT32_(value) << CAN_CREL_MCAN_REL_Pos)) /* Assignment of value for REL in the CAN_CREL_MCAN register */
#define CAN_CREL_MCAN_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (CAN_CREL_MCAN) Register Mask  */


