Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/can.h
#define CAN_TS7_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS7) Timestamp Word TS7 Position */
#define CAN_TS7_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS7_TS_Pos)             /* (CAN_TS7) Timestamp Word TS7 Mask */
#define CAN_TS7_TS(value)                     (CAN_TS7_TS_Msk & (_UINT32_(value) << CAN_TS7_TS_Pos)) /* Assignment of value for TS in the CAN_TS7 register */
#define CAN_TS7_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS7) Register Mask  */


/* -------- CAN_TS8 : (CAN Offset: 0x290) ( R/ 32) Timestamp 8 -------- */
#define CAN_TS8_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS8) Timestamp 8  Reset Value */

#define CAN_TS8_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS8) Timestamp Word TS8 Position */
#define CAN_TS8_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS8_TS_Pos)             /* (CAN_TS8) Timestamp Word TS8 Mask */
#define CAN_TS8_TS(value)                     (CAN_TS8_TS_Msk & (_UINT32_(value) << CAN_TS8_TS_Pos)) /* Assignment of value for TS in the CAN_TS8 register */
#define CAN_TS8_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS8) Register Mask  */


/* -------- CAN_TS9 : (CAN Offset: 0x294) ( R/ 32) Timestamp 9 -------- */
#define CAN_TS9_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS9) Timestamp 9  Reset Value */

#define CAN_TS9_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS9) Timestamp Word TS9 Position */
#define CAN_TS9_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS9_TS_Pos)             /* (CAN_TS9) Timestamp Word TS9 Mask */
#define CAN_TS9_TS(value)                     (CAN_TS9_TS_Msk & (_UINT32_(value) << CAN_TS9_TS_Pos)) /* Assignment of value for TS in the CAN_TS9 register */
#define CAN_TS9_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS9) Register Mask  */


/* -------- CAN_TS10 : (CAN Offset: 0x298) ( R/ 32) Timestamp 10 -------- */
#define CAN_TS10_RESETVALUE                   _UINT32_(0x00)                                       /*  (CAN_TS10) Timestamp 10  Reset Value */

#define CAN_TS10_TS_Pos                       _UINT32_(0)                                          /* (CAN_TS10) Timestamp Word TS10 Position */
#define CAN_TS10_TS_Msk                       (_UINT32_(0xFFFFFFFF) << CAN_TS10_TS_Pos)            /* (CAN_TS10) Timestamp Word TS10 Mask */
#define CAN_TS10_TS(value)                    (CAN_TS10_TS_Msk & (_UINT32_(value) << CAN_TS10_TS_Pos)) /* Assignment of value for TS in the CAN_TS10 register */
#define CAN_TS10_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS10) Register Mask  */


/* -------- CAN_TS11 : (CAN Offset: 0x29C) ( R/ 32) Timestamp 11 -------- */
#define CAN_TS11_RESETVALUE                   _UINT32_(0x00)                                       /*  (CAN_TS11) Timestamp 11  Reset Value */

#define CAN_TS11_TS_Pos                       _UINT32_(0)                                          /* (CAN_TS11) Timestamp Word TS11 Position */
#define CAN_TS11_TS_Msk                       (_UINT32_(0xFFFFFFFF) << CAN_TS11_TS_Pos)            /* (CAN_TS11) Timestamp Word TS11 Mask */
#define CAN_TS11_TS(value)                    (CAN_TS11_TS_Msk & (_UINT32_(value) << CAN_TS11_TS_Pos)) /* Assignment of value for TS in the CAN_TS11 register */
#define CAN_TS11_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS11) Register Mask  */


/* -------- CAN_TS12 : (CAN Offset: 0x2A0) ( R/ 32) Timestamp 12 -------- */
#define CAN_TS12_RESETVALUE                   _UINT32_(0x00)                                       /*  (CAN_TS12) Timestamp 12  Reset Value */

#define CAN_TS12_TS_Pos                       _UINT32_(0)                                          /* (CAN_TS12) Timestamp Word TS12 Position */
#define CAN_TS12_TS_Msk                       (_UINT32_(0xFFFFFFFF) << CAN_TS12_TS_Pos)            /* (CAN_TS12) Timestamp Word TS12 Mask */
#define CAN_TS12_TS(value)                    (CAN_TS12_TS_Msk & (_UINT32_(value) << CAN_TS12_TS_Pos)) /* Assignment of value for TS in the CAN_TS12 register */
#define CAN_TS12_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS12) Register Mask  */


/* -------- CAN_TS13 : (CAN Offset: 0x2A4) ( R/ 32) Timestamp 13 -------- */
#define CAN_TS13_RESETVALUE                   _UINT32_(0x00)                                       /*  (CAN_TS13) Timestamp 13  Reset Value */

#define CAN_TS13_TS_Pos                       _UINT32_(0)                                          /* (CAN_TS13) Timestamp Word TS13 Position */
#define CAN_TS13_TS_Msk                       (_UINT32_(0xFFFFFFFF) << CAN_TS13_TS_Pos)            /* (CAN_TS13) Timestamp Word TS13 Mask */
#define CAN_TS13_TS(value)                    (CAN_TS13_TS_Msk & (_UINT32_(value) << CAN_TS13_TS_Pos)) /* Assignment of value for TS in the CAN_TS13 register */
#define CAN_TS13_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS13) Register Mask  */


/* -------- CAN_TS14 : (CAN Offset: 0x2A8) ( R/ 32) Timestamp 14 -------- */
#define CAN_TS14_RESETVALUE                   _UINT32_(0x00)                                       /*  (CAN_TS14) Timestamp 14  Reset Value */

#define CAN_TS14_TS_Pos                       _UINT32_(0)                                          /* (CAN_TS14) Timestamp Word TS14 Position */
#define CAN_TS14_TS_Msk                       (_UINT32_(0xFFFFFFFF) << CAN_TS14_TS_Pos)            /* (CAN_TS14) Timestamp Word TS14 Mask */
#define CAN_TS14_TS(value)                    (CAN_TS14_TS_Msk & (_UINT32_(value) << CAN_TS14_TS_Pos)) /* Assignment of value for TS in the CAN_TS14 register */
#define CAN_TS14_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS14) Register Mask  */


/* -------- CAN_TS15 : (CAN Offset: 0x2AC) ( R/ 32) Timestamp 15 -------- */
#define CAN_TS15_RESETVALUE                   _UINT32_(0x00)                                       /*  (CAN_TS15) Timestamp 15  Reset Value */

#define CAN_TS15_TS_Pos                       _UINT32_(0)                                          /* (CAN_TS15) Timestamp Word TS15 Position */
#define CAN_TS15_TS_Msk                       (_UINT32_(0xFFFFFFFF) << CAN_TS15_TS_Pos)            /* (CAN_TS15) Timestamp Word TS15 Mask */
#define CAN_TS15_TS(value)                    (CAN_TS15_TS_Msk & (_UINT32_(value) << CAN_TS15_TS_Pos)) /* Assignment of value for TS in the CAN_TS15 register */
#define CAN_TS15_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS15) Register Mask  */


/* -------- CAN_ATB : (CAN Offset: 0x2B0) (R/W 32) Actual Timebase -------- */
#define CAN_ATB_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_ATB) Actual Timebase  Reset Value */

#define CAN_ATB_TB_Pos                        _UINT32_(0)                                          /* (CAN_ATB) Timebase for timestamp generation Position */
#define CAN_ATB_TB_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_ATB_TB_Pos)             /* (CAN_ATB) Timebase for timestamp generation Mask */
#define CAN_ATB_TB(value)                     (CAN_ATB_TB_Msk & (_UINT32_(value) << CAN_ATB_TB_Pos)) /* Assignment of value for TB in the CAN_ATB register */
#define CAN_ATB_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_ATB) Register Mask  */


/* CAN register offsets definitions */
#define CAN_R0_REG_OFST                _UINT32_(0x00)      /* (CAN_R0) Rx Buffer and FIFO Element 0 Offset */
#define CAN_R1_REG_OFST                _UINT32_(0x04)      /* (CAN_R1) Rx Buffer and FIFO Element 1 Offset */
#define CAN_R2_REG_OFST                _UINT32_(0x08)      /* (CAN_R2) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_0_REG_OFST              _UINT32_(0x08)      /* (CAN_R2_0) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_1_REG_OFST              _UINT32_(0x0C)      /* (CAN_R2_1) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_2_REG_OFST              _UINT32_(0x10)      /* (CAN_R2_2) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_3_REG_OFST              _UINT32_(0x14)      /* (CAN_R2_3) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_4_REG_OFST              _UINT32_(0x18)      /* (CAN_R2_4) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_5_REG_OFST              _UINT32_(0x1C)      /* (CAN_R2_5) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_6_REG_OFST              _UINT32_(0x20)      /* (CAN_R2_6) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_7_REG_OFST              _UINT32_(0x24)      /* (CAN_R2_7) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_8_REG_OFST              _UINT32_(0x28)      /* (CAN_R2_8) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_9_REG_OFST              _UINT32_(0x2C)      /* (CAN_R2_9) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_10_REG_OFST             _UINT32_(0x30)      /* (CAN_R2_10) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_11_REG_OFST             _UINT32_(0x34)      /* (CAN_R2_11) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_12_REG_OFST             _UINT32_(0x38)      /* (CAN_R2_12) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_13_REG_OFST             _UINT32_(0x3C)      /* (CAN_R2_13) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_14_REG_OFST             _UINT32_(0x40)      /* (CAN_R2_14) Rx Buffer and FIFO Element Data Offset */
#define CAN_R2_15_REG_OFST             _UINT32_(0x44)      /* (CAN_R2_15) Rx Buffer and FIFO Element Data Offset */
#define CAN_S0_REG_OFST                _UINT32_(0x00)      /* (CAN_S0) Standard Message ID Filter Element Offset */
#define CAN_T0_REG_OFST                _UINT32_(0x00)      /* (CAN_T0) Tx Buffer Element 0 Offset */
#define CAN_T1_REG_OFST                _UINT32_(0x04)      /* (CAN_T1) Tx Buffer Element 1 Offset */
#define CAN_T2_REG_OFST                _UINT32_(0x08)      /* (CAN_T2) Tx Buffer Element Data Offset */
#define CAN_T2_0_REG_OFST              _UINT32_(0x08)      /* (CAN_T2_0) Tx Buffer Element Data Offset */
#define CAN_T2_1_REG_OFST              _UINT32_(0x0C)      /* (CAN_T2_1) Tx Buffer Element Data Offset */
#define CAN_T2_2_REG_OFST              _UINT32_(0x10)      /* (CAN_T2_2) Tx Buffer Element Data Offset */
#define CAN_T2_3_REG_OFST              _UINT32_(0x14)      /* (CAN_T2_3) Tx Buffer Element Data Offset */
#define CAN_T2_4_REG_OFST              _UINT32_(0x18)      /* (CAN_T2_4) Tx Buffer Element Data Offset */
#define CAN_T2_5_REG_OFST              _UINT32_(0x1C)      /* (CAN_T2_5) Tx Buffer Element Data Offset */
#define CAN_T2_6_REG_OFST              _UINT32_(0x20)      /* (CAN_T2_6) Tx Buffer Element Data Offset */
#define CAN_T2_7_REG_OFST              _UINT32_(0x24)      /* (CAN_T2_7) Tx Buffer Element Data Offset */
#define CAN_T2_8_REG_OFST              _UINT32_(0x28)      /* (CAN_T2_8) Tx Buffer Element Data Offset */
#define CAN_T2_9_REG_OFST              _UINT32_(0x2C)      /* (CAN_T2_9) Tx Buffer Element Data Offset */
#define CAN_T2_10_REG_OFST             _UINT32_(0x30)      /* (CAN_T2_10) Tx Buffer Element Data Offset */
#define CAN_T2_11_REG_OFST             _UINT32_(0x34)      /* (CAN_T2_11) Tx Buffer Element Data Offset */
#define CAN_T2_12_REG_OFST             _UINT32_(0x38)      /* (CAN_T2_12) Tx Buffer Element Data Offset */
#define CAN_T2_13_REG_OFST             _UINT32_(0x3C)      /* (CAN_T2_13) Tx Buffer Element Data Offset */
#define CAN_T2_14_REG_OFST             _UINT32_(0x40)      /* (CAN_T2_14) Tx Buffer Element Data Offset */
#define CAN_T2_15_REG_OFST             _UINT32_(0x44)      /* (CAN_T2_15) Tx Buffer Element Data Offset */
#define CAN_E0_REG_OFST                _UINT32_(0x00)      /* (CAN_E0) Tx Event FIFO Element 0 Offset */
#define CAN_E1_REG_OFST                _UINT32_(0x04)      /* (CAN_E1) Tx Event FIFO Element 1 Offset */
#define CAN_F0_REG_OFST                _UINT32_(0x00)      /* (CAN_F0) Extended Message ID Filter Element 0 Offset */
#define CAN_F1_REG_OFST                _UINT32_(0x04)      /* (CAN_F1) Extended Message ID Filter Element 1 Offset */
#define CAN_CTRLA_REG_OFST             _UINT32_(0x00)      /* (CAN_CTRLA) Control A Register Offset */
#define CAN_CTRLB_REG_OFST             _UINT32_(0x04)      /* (CAN_CTRLB) Control B Register Offset */
#define CAN_INTENCLR_REG_OFST          _UINT32_(0x28)      /* (CAN_INTENCLR) Interrupt Enable Clear register Offset */
#define CAN_INTENSET_REG_OFST          _UINT32_(0x2C)      /* (CAN_INTENSET) Interrupt Enable Set register Offset */
#define CAN_INTFLAG_REG_OFST           _UINT32_(0x30)      /* (CAN_INTFLAG) Interrupt Flag Status and Clear register Offset */
#define CAN_INTFLAGSET_REG_OFST        _UINT32_(0x34)      /* (CAN_INTFLAGSET) Interrupt Flag Software Set Register Offset */
#define CAN_SYNCBUSY_REG_OFST          _UINT32_(0x5C)      /* (CAN_SYNCBUSY) SYNCBUSY Register Offset */
#define CAN_CREL_MCAN_REG_OFST         _UINT32_(0x100)     /* (CAN_CREL_MCAN) Core Release Offset */
#define CAN_ENDN_REG_OFST              _UINT32_(0x104)     /* (CAN_ENDN) Endian Offset */
#define CAN_CUST_REG_OFST              _UINT32_(0x108)     /* (CAN_CUST) Customer Register Offset */
#define CAN_DBTP_REG_OFST              _UINT32_(0x10C)     /* (CAN_DBTP) Fast Bit Timing and Prescaler Offset */
#define CAN_TEST_REG_OFST              _UINT32_(0x110)     /* (CAN_TEST) Test Offset */
#define CAN_RWD_REG_OFST               _UINT32_(0x114)     /* (CAN_RWD) RAM Watchdog Offset */
#define CAN_CCCR_REG_OFST              _UINT32_(0x118)     /* (CAN_CCCR) CC Control Offset */
#define CAN_NBTP_REG_OFST              _UINT32_(0x11C)     /* (CAN_NBTP) Nominal Bit Timing and Prescaler Offset */
#define CAN_TSCC_REG_OFST              _UINT32_(0x120)     /* (CAN_TSCC) Timestamp Counter Configuration Offset */
#define CAN_TSCV_REG_OFST              _UINT32_(0x124)     /* (CAN_TSCV) Timestamp Counter Value Offset */
#define CAN_TOCC_REG_OFST              _UINT32_(0x128)     /* (CAN_TOCC) Timeout Counter Configuration Offset */
#define CAN_TOCV_REG_OFST              _UINT32_(0x12C)     /* (CAN_TOCV) Timeout Counter Value Offset */
#define CAN_ECR_REG_OFST               _UINT32_(0x140)     /* (CAN_ECR) Error Counter Offset */
#define CAN_PSR_REG_OFST               _UINT32_(0x144)     /* (CAN_PSR) Protocol Status Offset */
#define CAN_TDCR_REG_OFST              _UINT32_(0x148)     /* (CAN_TDCR) Extended ID Filter Configuration Offset */
#define CAN_IR_REG_OFST                _UINT32_(0x150)     /* (CAN_IR) Interrupt Offset */
#define CAN_IE_REG_OFST                _UINT32_(0x154)     /* (CAN_IE) Interrupt Enable Offset */
#define CAN_ILS_REG_OFST               _UINT32_(0x158)     /* (CAN_ILS) Interrupt Line Select Offset */
#define CAN_ILE_REG_OFST               _UINT32_(0x15C)     /* (CAN_ILE) Interrupt Line Enable Offset */
#define CAN_GFC_REG_OFST               _UINT32_(0x180)     /* (CAN_GFC) Global Filter Configuration Offset */
#define CAN_SIDFC_REG_OFST             _UINT32_(0x184)     /* (CAN_SIDFC) Standard ID Filter Configuration Offset */
#define CAN_XIDFC_REG_OFST             _UINT32_(0x188)     /* (CAN_XIDFC) Extended ID Filter Configuration Offset */
#define CAN_XIDAM_REG_OFST             _UINT32_(0x190)     /* (CAN_XIDAM) Extended ID AND Mask Offset */
#define CAN_HPMS_REG_OFST              _UINT32_(0x194)     /* (CAN_HPMS) High Priority Message Status Offset */
#define CAN_NDAT1_REG_OFST             _UINT32_(0x198)     /* (CAN_NDAT1) New Data 1 Offset */
#define CAN_NDAT2_REG_OFST             _UINT32_(0x19C)     /* (CAN_NDAT2) New Data 2 Offset */
#define CAN_RXF0C_REG_OFST             _UINT32_(0x1A0)     /* (CAN_RXF0C) Rx FIFO 0 Configuration Offset */
#define CAN_RXF0S_REG_OFST             _UINT32_(0x1A4)     /* (CAN_RXF0S) Rx FIFO 0 Status Offset */
#define CAN_RXF0A_REG_OFST             _UINT32_(0x1A8)     /* (CAN_RXF0A) Rx FIFO 0 Acknowledge Offset */
#define CAN_RXBC_REG_OFST              _UINT32_(0x1AC)     /* (CAN_RXBC) Rx Buffer Configuration Offset */
#define CAN_RXF1C_REG_OFST             _UINT32_(0x1B0)     /* (CAN_RXF1C) Rx FIFO 1 Configuration Offset */
#define CAN_RXF1S_REG_OFST             _UINT32_(0x1B4)     /* (CAN_RXF1S) Rx FIFO 1 Status Offset */
#define CAN_RXF1A_REG_OFST             _UINT32_(0x1B8)     /* (CAN_RXF1A) Rx FIFO 1 Acknowledge Offset */
#define CAN_RXESC_REG_OFST             _UINT32_(0x1BC)     /* (CAN_RXESC) Rx Buffer / FIFO Element Size Configuration Offset */
#define CAN_TXBC_REG_OFST              _UINT32_(0x1C0)     /* (CAN_TXBC) Tx Buffer Configuration Offset */
#define CAN_TXFQS_REG_OFST             _UINT32_(0x1C4)     /* (CAN_TXFQS) Tx FIFO / Queue Status Offset */
#define CAN_TXESC_REG_OFST             _UINT32_(0x1C8)     /* (CAN_TXESC) Tx Buffer Element Size Configuration Offset */
#define CAN_TXBRP_REG_OFST             _UINT32_(0x1CC)     /* (CAN_TXBRP) Tx Buffer Request Pending Offset */
#define CAN_TXBAR_REG_OFST             _UINT32_(0x1D0)     /* (CAN_TXBAR) Tx Buffer Add Request Offset */
#define CAN_TXBCR_REG_OFST             _UINT32_(0x1D4)     /* (CAN_TXBCR) Tx Buffer Cancellation Request Offset */
#define CAN_TXBTO_REG_OFST             _UINT32_(0x1D8)     /* (CAN_TXBTO) Tx Buffer Transmission Occurred Offset */
#define CAN_TXBCF_REG_OFST             _UINT32_(0x1DC)     /* (CAN_TXBCF) Tx Buffer Cancellation Finished Offset */
#define CAN_TXBTIE_REG_OFST            _UINT32_(0x1E0)     /* (CAN_TXBTIE) Tx Buffer Transmission Interrupt Enable Offset */
#define CAN_TXBCIE_REG_OFST            _UINT32_(0x1E4)     /* (CAN_TXBCIE) Tx Buffer Cancellation Finished Interrupt Enable Offset */
#define CAN_TXEFC_REG_OFST             _UINT32_(0x1F0)     /* (CAN_TXEFC) Tx Event FIFO Configuration Offset */
#define CAN_TXEFS_REG_OFST             _UINT32_(0x1F4)     /* (CAN_TXEFS) Tx Event FIFO Status Offset */
#define CAN_TXEFA_REG_OFST             _UINT32_(0x1F8)     /* (CAN_TXEFA) Tx Event FIFO Acknowledge Offset */
#define CAN_CREL_TSU_REG_OFST          _UINT32_(0x260)     /* (CAN_CREL_TSU) TSU CREL Offset */
#define CAN_TSCFG_REG_OFST             _UINT32_(0x264)     /* (CAN_TSCFG) Timestamp Configuration Offset */
#define CAN_TSS1_REG_OFST              _UINT32_(0x268)     /* (CAN_TSS1) Timestamp Status 1 Offset */
#define CAN_TSS2_REG_OFST              _UINT32_(0x26C)     /* (CAN_TSS2) Timestamp Status 2 Offset */
#define CAN_TS0_REG_OFST               _UINT32_(0x270)     /* (CAN_TS0) Timestamp 0 Offset */
#define CAN_TS1_REG_OFST               _UINT32_(0x274)     /* (CAN_TS1) Timestamp 1 Offset */
#define CAN_TS2_REG_OFST               _UINT32_(0x278)     /* (CAN_TS2) Timestamp 2 Offset */
#define CAN_TS3_REG_OFST               _UINT32_(0x27C)     /* (CAN_TS3) Timestamp 3 Offset */
#define CAN_TS4_REG_OFST               _UINT32_(0x280)     /* (CAN_TS4) Timestamp 4 Offset */
#define CAN_TS5_REG_OFST               _UINT32_(0x284)     /* (CAN_TS5) Timestamp 5 Offset */
#define CAN_TS6_REG_OFST               _UINT32_(0x288)     /* (CAN_TS6) Timestamp 6 Offset */
#define CAN_TS7_REG_OFST               _UINT32_(0x28C)     /* (CAN_TS7) Timestamp 7 Offset */
#define CAN_TS8_REG_OFST               _UINT32_(0x290)     /* (CAN_TS8) Timestamp 8 Offset */
#define CAN_TS9_REG_OFST               _UINT32_(0x294)     /* (CAN_TS9) Timestamp 9 Offset */
#define CAN_TS10_REG_OFST              _UINT32_(0x298)     /* (CAN_TS10) Timestamp 10 Offset */
#define CAN_TS11_REG_OFST              _UINT32_(0x29C)     /* (CAN_TS11) Timestamp 11 Offset */
#define CAN_TS12_REG_OFST              _UINT32_(0x2A0)     /* (CAN_TS12) Timestamp 12 Offset */
#define CAN_TS13_REG_OFST              _UINT32_(0x2A4)     /* (CAN_TS13) Timestamp 13 Offset */
#define CAN_TS14_REG_OFST              _UINT32_(0x2A8)     /* (CAN_TS14) Timestamp 14 Offset */
#define CAN_TS15_REG_OFST              _UINT32_(0x2AC)     /* (CAN_TS15) Timestamp 15 Offset */
#define CAN_ATB_REG_OFST               _UINT32_(0x2B0)     /* (CAN_ATB) Actual Timebase Offset */

